In [150]:
import pandas as pd

we import pandas

In [151]:
data = {
      'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Eve'],
      'Age': [24, 27, 22, 32, 29],
      'Department': ['HR', 'Finance', 'IT', 'Marketing', 'HR'],
      'Salary': [45000, 54000, 50000, 62000, 47000]
  }

we create a dataframe "data"

In [152]:
df = pd.DataFrame(data)

we convert the dictionary into pandas dataframe
using y = pd.DataFrame(x)

In [153]:
df.head(5)

      Name  Age Department  Salary
0    Alice   24         HR   45000
1      Bob   27    Finance   54000
2  Charlie   22         IT   50000
3    Diana   32  Marketing   62000
4      Eve   29         HR   47000

we print the top five rows

In [154]:
df.describe()

             Age        Salary
count   5.000000      5.000000
mean   26.800000  51600.000000
std     3.962323   6730.527468
min    22.000000  45000.000000
25%    24.000000  47000.000000
50%    27.000000  50000.000000
75%    29.000000  54000.000000
max    32.000000  62000.000000

we print summary statistics of the age and salary column using .describe()

In [155]:
print("Average salary of HR department", df[df["Department"] == "HR"]["Salary"].mean())

Average salary of HR department 46000.0

we print the average salary of HR department by
filtering the rows where department is hr and then
from the filtered df we calculate mean of salary column using .mean.

In [156]:

df["Bonus"] = df["Salary"] * 0.10
df.head(5)

      Name  Age Department  Salary   Bonus
0    Alice   24         HR   45000  4500.0
1      Bob   27    Finance   54000  5400.0
2  Charlie   22         IT   50000  5000.0
3    Diana   32  Marketing   62000  6200.0
4      Eve   29         HR   47000  4700.0

we derive bonus column by multiplying salary column by 
0.10 which gives us 10 percent of the value of salary

In [157]:
df_age_bw_25_30 = df[(df["Age"] >= 25) & (df["Age"] <= 30)]
print(df_age_bw_25_30)

  Name  Age Department  Salary   Bonus
1  Bob   27    Finance   54000  5400.0
4  Eve   29         HR   47000  4700.0

we initialise df_age_bw_25_30 where we store all the rows where age is greater than 25 & age is less than 30

In [158]:
grouped = df.groupby("Department")["Salary"].mean()
print("Average salary by department:")
print(grouped)

Average salary by department:
Department
Finance      54000.0
HR           46000.0
IT           50000.0
Marketing    62000.0
Name: Salary, dtype: float64

we initialise grouped that has mean of salary after we group df by department using .groupby

In [159]:
asc_by_sal = df.sort_values(by="Salary")
asc_by_sal.to_csv("Sorted by Salary.csv",index=False)

we sort the rows in ascending order of salary using .sort_values and passing parameter by="Salary"
we save the asc_by_sal using .to_csv and parameter index=False

In [160]:
asc_by_sal

      Name  Age Department  Salary   Bonus
0    Alice   24         HR   45000  4500.0
4      Eve   29         HR   47000  4700.0
2  Charlie   22         IT   50000  5000.0
1      Bob   27    Finance   54000  5400.0
3    Diana   32  Marketing   62000  6200.0